'-------------------------------------------------------------------------------------
' English language module for WINCONTIG
'
' Translated by:
'   Marco D'Amato (md<at>mdtzone<dot>it)
'
' Currently maintained by:
'   Marco D'Amato (md<at>mdtzone<dot>it)
'
' NOTE: Don't translate '\r', '\n', '\t', '%s', '%d', '$c$', '$d$' and $s$
'
'-------------------------------------------------------------------------------------
' Language Name of the module in your native language ***
' (e.g. Italiano, Français, etc)
'-------------------------------------------------------------------------------------
LNG=English
'-------------------------------------------------------------------------------------
' Main program window - "General" Tab (misc) ***
'-------------------------------------------------------------------------------------
1=Fragmented files:
2=Contiguous files:
3=Defragmented files:
4=Not processed files:
195=CURRENT SESSION
199=Start time:
200=Action:
222=Current operation:
215=File Defragmentation
207=File Analysis
209=Completed
211=Canceled by the user
212=Canceled
688=Canceled (computer running on battery power)
213=Analyzing...
216=Skipped all items
219=LAST SESSION
217=General
227=Total processed files:
228=Defragmented files:
234=n/a
254=Checking volumes for file system errors...
257=Disk cleaning up...
'-------------------------------------------------------------------------------------
' Main program window - Toolbar buttons labels ***
'-------------------------------------------------------------------------------------
17=Add
20=Open profile
21=Save profile
455=Filter
24=Defragment
25=Stop
'-------------------------------------------------------------------------------------
' Main program window - Toolbar buttons tooltips ***
'-------------------------------------------------------------------------------------
473=Add
474=Add one or more files to the list. Click the arrow to add folders.
475=Remove
476=Remove the selected items from the list.
477=Properties
478=Display the properties of the selected items.
479=Fragments
480=Display additional information about the selected files, including the size and the number of fragments the files consist of.
481=Filter
482=Show the Filter dialog box to exclude or include specific files, folders and file types from analysis and defragmentation.
483=Open profile
484=Load a list of items from a previously saved profile file.
485=Save profile
717=Save the current profile.
26=Analyze
45=Analyze the files in order to determine how fragmented they are.
101=Defragment
139=Consolidate fragmented files to improve system performance. Click the arrow to defragment only the fragmented files selected in the lower pane.
122=Stop
136=Stop the current operation in progress.
631=Check for errors
632=Check listed volumes for file system errors.
690=Settings
691=Enable you to change settings.
486=Copy to upper pane
488=Copy the selected fragmented files from the lower pane to the upper pane.
362=Disk zone
369=Enable you to specify into which zone of the disk the selected items should be placed.
'-------------------------------------------------------------------------------------
' Main program window - Toolbar Drop Down Menu ("Add" button) ***
'-------------------------------------------------------------------------------------
65=Add &file...\tCTRL+O
634=Add f&older...\tCTRL+SHIFT+O
'-------------------------------------------------------------------------------------
' Main program window - Toolbar Drop Down Menu ("Del" button) ***
'-------------------------------------------------------------------------------------
517=&Remove selected items
518=Remove &all items
'-------------------------------------------------------------------------------------
' Main program window - Toolbar Drop Down Menu ("Profile" button) ***
'-------------------------------------------------------------------------------------
155=<empty>
'-------------------------------------------------------------------------------------
' Main program window - Toolbar Drop Down Menu ("Defragment" button) ***
'-------------------------------------------------------------------------------------
365=&Defragment all files
156=Defragment only &selected fragmented files
'----------------------------------------------------------------------------------------------
' Main program window - Items to be processed (Column Headers/Column Header Context Menu) ***
'----------------------------------------------------------------------------------------------
27=File name
150=Disk zone
295=Subfolders
28=Size
29=Status
30=Type
248=Fragments
249=Clusters
250=Size on disk
274=% on disk
472=Last modified date
487=Attributes
31=Fragmentation (file)
251=Default
296=Specifies if include or not include subfolders when processing folders. Double click on a row within this column to include or not include subfolders.
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed ("Subfolders" Column) ***
'-------------------------------------------------------------------------------------
297=Include
300=Not include
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed ("Disk zone" Column) ***
'-------------------------------------------------------------------------------------
198=Auto
276=Fast zone
283=Slow zone
340=Cluster %s
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed ("Status" Column) ***
'-------------------------------------------------------------------------------------
5=Fragmented
6=Not fragmented
7=Error
8=Defragmented
@146=Contiguous
424=Processing...
218=Skipped (filtered out)
220=Skipped (stored on SSD)
226=Canceled
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed (misc) ***
'-------------------------------------------------------------------------------------
247=Root folder
511=Items list is empty.
512=Click to add one or more items to the list
'-------------------------------------------------------------------------------------
' Main program window - Items to be processed (Context Menu) ***
'-------------------------------------------------------------------------------------
67=&Open
68=&Add item
69=&File...\tCTRL+O
635=F&older...\tCTRL+SHIFT+O
71=&Remove items\tDEL
371=Add to e&xclusions list
15=Analy&ze selected items
16=&Defragment selected items
160=&Specify disk zone...
312=&Include subfolders
322=&Not include subfolders
327=Open item lo&cation
223=Prop&erties
'--------------------------------------------------------------------------------------------------
' Main program window - "Fragmented files" Tab (Column Headers/Column Header Context Menu) ***
'--------------------------------------------------------------------------------------------------
9=Fragments
252=Clusters
19=Fragmentation
253=Size on disk
10=Size
11=File name
183=Path
275=% on disk
256=Default
'--------------------------------------------------------------------------------------------------
' Main program window - "Fragmented files" Tab (Search for fragmented files) ***
'--------------------------------------------------------------------------------------------------
282=No items matching your search criteria were found.
380=Search for files (CTRL+F).
381=Click here and press F1 for Help.
382=The file list is empty.
383=Analyzing items...
'-------------------------------------------------------------------------------------
' Main program window - "Fragmented files" Tab (misc) ***
'-------------------------------------------------------------------------------------
144=Fragmented files
12=No fragmented files found.
428=No files have been processed yet.
426=%d1 of %d2
'-------------------------------------------------------------------------------------
' Main program window - "Fragmented files" Tab (Context Menu) ***
'-------------------------------------------------------------------------------------
363=&Select highlighted files
364=&Deselect highlighted files
367=&Invert selection
372=Add to e&xclusions list
162=Open file lo&cation
489=C&opy to upper pane
'--------------------------------------------------------------------------------------------------
' Main program window - "Fragmented files" listview (checkbox) tooltip ***
'--------------------------------------------------------------------------------------------------
171=Select/Deselect
161=Select or deselect all listed files.
'--------------------------------------------------------------------------------------------------
' Main program window - "Errors" Tab (Column Headers) ***
'--------------------------------------------------------------------------------------------------
128=File name
245=Path
129=Error
'--------------------------------------------------------------------------------------------------
' Main program window - "Errors" Tab (misc) ***
'--------------------------------------------------------------------------------------------------
98=Errors
145=No errors encountered while processing the files.
'-------------------------------------------------------------------------------------
' Main program window - Statusbar messages ***
'-------------------------------------------------------------------------------------
32=Idle
33=Total listed items:
420=Total processed files:
'-------------------------------------------------------------------------------------
' Main program window - File menu ***
'-------------------------------------------------------------------------------------
34=&File
35=Ope&n
36=&Add item
37=&File...\tCTRL+O
636=Fo&lder...\tCTRL+SHIFT+O
39=&Remove items\tDEL
370=Add to ex&clusions list
284=Fragment infor&mation
224=Prop&erties
421=Sa&ve analysis report...
41=E&xit
'-------------------------------------------------------------------------------------
' Main program window - Profile menu ***
'-------------------------------------------------------------------------------------
42=&Profile
43=&Open profile...
719=&Save profile
44=Save profile &as...
736=&Close profile
'-------------------------------------------------------------------------------------
' Main program window - Action menu ***
'-------------------------------------------------------------------------------------
46=&Action
47=A&nalyze
49=&Stop
630=&Check for errors
50=&Defragment
'-------------------------------------------------------------------------------------
' Main program window - View menu ***
'-------------------------------------------------------------------------------------
48=&View
51=&Toolbar
76=&Status bar
'-------------------------------------------------------------------------------------
' Main program window - Tools menu ***
'-------------------------------------------------------------------------------------
377=&Tools
239=&Install the shell extension
242=&Uninstall the shell extension
470=&Manage filter
'-------------------------------------------------------------------------------------
' Main program window - Options menu ***
'-------------------------------------------------------------------------------------
668=&Settings\tALT+O
692=Stay o&n top\tCTRL+T
'-------------------------------------------------------------------------------------
' Main program window - Disk zone menu ***
'-------------------------------------------------------------------------------------
419=&Auto
440=&Fast access zone
441=&Slow access zone
457=Speci&fy disk zone...
'-------------------------------------------------------------------------------------
' Disk Zone window
'-------------------------------------------------------------------------------------
241=Disk zone
311=Disk zone
240=Here you can specify into which zone of the disk the selected items should be placed.
243=Disk zone:
267=Disk cluster:
269=&Move exclusively to the specified zone
270=Fast access zone
271=Slow access zone
272=Auto
273=User defined
289=(Specified different zones)
307=(Specified different clusters)
328=Specifies to not try to move the items to a different area of the disk when the items cannot be placed in the specified zone.
361=Conflict detected
356=This item cannot be moved exclusively to the specified disk cluster because another item is marked to be moved exclusively to the same disk cluster.
'-------------------------------------------------------------------------------------
' Settings window
'-------------------------------------------------------------------------------------
643=General
644=Notifications and actions
645=Interface
647=Settings
708=Profiles
709=Open the fo&llowing profile at startup:
710=Bro&wse...
711=&Select profile
712=Select profile
723=Select a profile
722=Please, select the profile that you want to open at startup.
713=Show the profile name in the title bar:
745=Display first the pr&ofile name in the title bar
714=Disabled
715=Only file name
716=Full file path
724=Recent profiles list
154=Recently used profile list entries (0-10):
134=Maximum count of characters for each entry (40-1000):
159=Automatically remove missin&g entries
739=Prompt to save cha&nges made to the profile before closing the profile
740=Prompt to save &changes made to the profile before exiting the application
18=S&how a warning message when opening a profile containing missing items
173=Limits the number of characters displayed for each recently used profile.
726=Show onl&y profile names
727=Arrange entries by:
728=File name
729=Full file path
730=Last accessed
648=&Press ESC key to close WinContig
649=Show W&inContig on top
686=Pr&event defragmentation of Solid State Drives (SSDs)
23=Disa&ble Solid State Drives (SSDs) detection
526=Stop &VSS prior to defragmenting
326=Disk media type detection
642=Media type
653=Detection
651=Automatic
652=Manual
523=Here you can manually override the media type that is associated with a physical disk. Select a disk to mark it as an SSD. Deselect a disk to mark it as an HDD. Double click on a disk to enable the automatic media type detection.
527=Temporarily disables Volume Shadow Copy Service during the defragmentation process to prevent growth of the VSS area storage.
56=Show confirmation &messages
693=Show a notification after a process is completed:
694=Pop-up window
695=In the notification area
655=Program priority:
656=Defragmentation strategy:
657=Check disks for errors prior to defragmenting:
658=Clean-up disks prior to defragmenting:
659=After the defragmentation is completed:
660=When computer runs on battery power:
40=Default double-click action in the upper pane:
63=Default double-click action in the Fragmented files tab:
72=Open 
77=Analyze
78=Defragment
351=Specify disk zone
79=Open item location
148=Open file location
80=Fragment information
81=Properties
135=Copy to upper pane
661=Language:
662=Show st&ate icons
665=Temperature scale:
187=&Show file name and path in separate columns
258=Show file count on &tabs
646=Show search bo&x in the Fragmented files tab
73=Switch to dark the&me based on operating system preference
664=Highlighting of items
667=Here you can customize the highlight colors of the items based on their state. To enable or disable the highlighting of an item, select or clear the corresponding checkbox.
412=&Fragmented item
413=Contig&uous item
414=&Defragmented item
415=E&rror
416=S&kipped item
696=&Highlight the row of the currently processed item
118=Us&e alternative color palette when dark theme is used
670=High
671=Above normal
672=Normal
673=Below normal
674=Low
675=Quick
676=Smart
677=Disabled
678=Automatic
679=Prompt for action
680=No action
681=Close program
682=Sign out
683=Restart
684=Shut down
755=Sleep
756=Hibernate
685=Prevent defragmentation
38=Show Errors Tab after a process is completed:
66=Disabled
70=Always
754=Only if errors occur
753=Fahrenheit (°F)
203=Celsius (°C)
93=Shell integration
13=&Cascading context menu
22=Show menu &icons
53=Show menu &separators
54=Show &Analyze menu item
99=Show &Defragment menu item
102=Optional command-line switches:
100=After the defragmentation:
115=Keep WinContig open
112=Close WinContig
113=Close WinContig only if no errors occur
103=&Help
104=H&elp
109=Analyze with WinContig
116=Defragment with WinContig
306=The shell extension of WinContig is not installed.
117=Advanced
140=Defragmentation engine:
151=Performance
152=Balanced
153=Responsive
158=Here you can set the behaviour of the defragmentation engine. For a description of an option, select it and then move the mouse pointer over the infotip icon.
157=The defragmentation engine prioritizes performance. If you select this option and the defragmentation engine is in the middle of a large move request, it may take a long time to stop a defragmentation session.
172=The defragmentation engine balances performance and responsiveness, so that it takes only few seconds to stop a defragmentation session.
188=The defragmentation engine prioritizes responsiveness, so that a defragmentation stop request completes almost instantly.
'-------------------------------------------------------------------------------------
' Main program window - Help menu ***
'-------------------------------------------------------------------------------------
60=&Help
61=Show &disclaimer
62=Show &command-line switches
64=&About WinContig
'-------------------------------------------------------------------------------------
' Menu Hints ***
'-------------------------------------------------------------------------------------
83=Adds files to the items list.
84=Adds a folder to the items list.
85=Removes the selected items from the list.
86=Adds the items listed in a profile to the items list.
718=Saves the current profile.
737=Closes the current profile.
87=Saves the items listed in the items list to a profile.
88=Quits WinContig.
89=Analyzes the items.
94=Shows the main program window always in front of all other windows.
110=Defragments the files.
96=Displays program information, version number and copyright.
105=Opens the selected files by using their associated applications.
106=Displays the command-line switches accepted by WinContig.
107=Shows the disclaimer.
225=Displays the properties of the selected items.
285=Displays additional file fragment information.
373=Adds the selected items to the exclusions list.
471=Manages the exclusion and inclusion lists.
429=Reverses which items are selected and which are not.
430=Selects the highlighted items.
431=Deselects the highlighted items.
422=Saves the analysis results.
82=Shows or hides the toolbar.
91=Shows or hides the status bar.
14=Defragments only the fragmented files selected in the lower pane.
141=Allows you to interrupt the current operation.
131=Analyzes only the items selected in the upper pane.
138=Defragments only the items selected in the upper pane.
163=Opens the folder containing the selected item.
341=Does include subfolders during the process of folders.
366=Does not include subfolders during the process of folders.
519=Removes all items from the list.
629=Checks listed volumes for file system errors.
669=Enables you to change settings.
246=Installs the shell extension of WinContig.
288=Uninstalls the shell extension of WinContig.
496=Copies the selected files to the upper pane.
197=Enables you to specify into which zone of the disk the selected items should be placed. 
504=Places automatically the selected items in the disk.
506=Places the selected items in the fast zone of the disk.
507=Places the selected items in the slow zone of the disk.
525=Enables you to specify into which zone of the disk the selected items should be placed.
'-------------------------------------------------------------------------------------
' Analysis Report ***
'-------------------------------------------------------------------------------------
177=Number of fragmented files
178=Number of contiguous files
179=Number of files that were not analyzed due to processing errors
182=Number of processed files
231=List of fragmented files:
232=List of files that were not analyzed:
290=Save report
291=Report was saved successfully.
292=Analysis report of WinContig created:
293=File statistics
'-------------------------------------------------------------------------------------
' "Add files" dialog box ***
'-------------------------------------------------------------------------------------
111=Add files
'-------------------------------------------------------------------------------------
' "Add folder" dialog box ***
'-------------------------------------------------------------------------------------
244=&Add folder
698=Add folder
697=Include &subfolders
699=In this dialog box you can add more than one folder. After you finish, click on the Close button or press the ESC key to close the dialog box.
700=Do not &show in future
701=Information
'-------------------------------------------------------------------------------------
' "Load profile" dialog box ***
'-------------------------------------------------------------------------------------
114=Open profile
'-------------------------------------------------------------------------------------
' "Save profile" dialog box ***
'-------------------------------------------------------------------------------------
720=Save profile as
721=New profile.wcp
516=Profile cannot be saved due to an error.
'-------------------------------------------------------------------------------------
' "Importing profile" dialog box ***
'-------------------------------------------------------------------------------------
119=Importing profile
120=&Append
121=&Replace
123=The items list is not empty.
704=Behavior:
705=Replace the items in the list
706=Add to the items in the list
124=Click <b>Append</b> to add the items listed in the profile to the items already in the list. Click <b>Replace</b> to replace the items in the list with the ones listed in the profile.
125=The file '%s' is not a valid profile of WinContig.
425=The profile '%s' does not exist.
707=The selected file is not a valid profile of WinContig.
524=The profile specified at the command prompt does not exist or it is not a valid profile of WinContig.
'-------------------------------------------------------------------------------------
' "Importing profile" dialog box - Items don't exist ***
'-------------------------------------------------------------------------------------
130=Importing profile
132=Cannot find some items listed in the profile. Items may have been renamed, moved or deleted.
133=List of items that were not imported:
513=&Fix profile
514=Fix profile
515=Removes the invalid items from the profile.
521=Profile has been fixed
522=Invalid items removed from the profile: %s
'-------------------------------------------------------------------------------------
' "Check disk" dialog box ***
'-------------------------------------------------------------------------------------
308=Check Disk
633=Here you can check the volumes for file system errors. WinContig will scan volumes by using Windows' built-in check disk function. It's highly recommended that you check the integrity of the files stored on your disks prior to defragmenting the files. Double click on a disk to show its properties.
309=In the future, do not check the &volumes
59=Stage %s
313=Check &Disk
314=Don't C&heck disk
317=Windows cannot run disk checking on CD-ROM and DVD-ROM drives.
318=WinContig has detected problems with a volume. We recommend that you quit WinContig and correct the problem.\nAlternately, you may also continue normally.
319=Start automatically the def&ragmentation process if no problems are found
95=No disk has been analyzed yet.
330=Check disk for errors
331=Windows cannot check a disk attached through a network.
432=Volume
433=File system
58=SSD
562=HDD
434=Total size
57=Used space
435=Free space
436=% Free space
437=Unknown drive
438=Removable drive
439=Hard drive
442=RAM disk
443=Session status
505=Ready
445=Completed
90=Total listed volumes:
92=Found errors
731=Checking of volume %s started
732=Please wait...
733=Checking of volume %s completed
108=Information
126=Analysis report
127=DISK INFORMATION (%s)
137=Volume label:
540=Boot volume:
205=Serial number:
229=File system:
230=Identificator:
255=Bytes per sector:
268=Sectors per cluster:
294=Used space:
310=Free space:
528=Total size:
321=SSD:
323=Total clusters:
324=Free clusters:
529=Used clusters:
325=n/a
329=yes
355=no
444=bytes
456=No volume selected
532=Used space:
531=Free space:
530=MFT size:
533=MFT starting cluster:
534=MFT reserved space starting cluster:
537=MFT reserved space ending cluster:
535=MFT reserved space size:
536=MFT mirror start:
538=(%s% of the volume)
539=&Copy to Clipboard
541=S.M.A.R.T.
'-- [BEGIN] S.M.A.R.T. Attribute Names -----------------------------------------------------------------------------------
550=Raw Read Error Rate
577=Throughput Performance
578=Spin-Up Time
579=Start/Stop Count
551=Reallocated Sectors Count
580=Read Channel Margin
581=Seek Error Rate
582=Seek Time Performance
552=Power-On Hours
583=Spin Retry Count
584=Calibration Retry Count
553=Power Cycle Count
554=SSD Program Fail Count
555=SSD Erase Fail Count
556=Unexpected power loss count
557=Power Loss Protection Failure
558=Erase Fail Count
559=Wear Range Delta
560=Used Reserved Block Count Total
561=Unused reserved block count total
563=Erase Fail Count
564=SATA Downshift Error Count
565=Reported Uncorrectable Errors
566=Command Timeout
567=G-sense Error Rate
568=Temperature
569=Hardware ECC Recovered
570=Soft Read Error Rate
571=Soft ECC Correction
572=SSD Life Left
573=Average erase count AND Maximum Erase Count
574=Total LBAs Written
575=Total LBAs Read
576=Read Error Retry Rate
585=Soft Read Error Rate
586=Current Helium Level
587=Available Reserved Space
588=SSD Wear Leveling Count
589=End-to-End error / IOEDC
590=High Fly Writes
591=Airflow Temperature
592=Power-off Retract Count
593=Load Cycle Count
594=Reallocation Event Count
595=Current Pending Sector Count
596=Uncorrectable Sector Count
597=UltraDMA CRC Error Count
598=Multi-Zone Error Rate
599=Run Out Cancel
600=Thermal Asperity Rate
601=Spin High Current
602=Spin Buzz
603=Offline Seek Performance
604=Vibration During Write
605=Shock During Write
606=Disk Shift
623=Erase/Program Cycles
607=G-Sense Error Rate
608=Loaded Hours
609=Load/Unload Retry Count
610=Load Friction
611=Load/Unload Cycle Count
612=Torque Amplification Count
613=Power-Off Retract Cycle
614=Endurance Remaining
615=Good Block Count AND System (Free) Block Count
616=Free Fall Protection
617=Newly Added Bad Flash Block
618=Program Fail Count Total or Non-4K Aligned Access Count
619=Head Flying Hours
'-- [END] S.M.A.R.T. Attribute Names -----------------------------------------------------------------------------------
620=Temperature:
638= °C
639= °F
621=Model:
622=Health:
542=ID
543=Attribute name
544=Value
545=Worst
546=Threshold
547=Raw data
548=Status
624=Good
625=Caution
626=S.M.A.R.T. is not supported or S.M.A.R.T. attributes could not be retrieved.
627=OK
628=Warning
'-------------------------------------------------------------------------------------
' "Disk Clean-up" dialog box ***
'-------------------------------------------------------------------------------------
339=Disk Clean-up
357=&Start Disk Clean-up
358=&Don't start Disk Clean-up
338=In the future, do not delete &temporary files
359=Prior to starting the defragmentation process, you can delete temporary files to recover disk space.
343=Deleting temporary files... Please wait.
345=GetTempPath function failed with error %s !
346=Cannot delete temporary files because they are stored in the root folder!
347=Cannot delete temporary files because the following temporary path does not exist:\n\n%s
446=Use &WinContig to delete temporary files
181=E&mpty Recycle Bin
447=Use &external application to delete temporary files
448=Program:
449=Additional command-line switches:
450=&Browse...
451=Select program
734=Programs (*.exe)
735=&Select program
453=No external application specified.
454=The external application specified does not exist!
'-------------------------------------------------------------------------------------
' "Exclusion/Inclusion List" dialog box ***
'-------------------------------------------------------------------------------------
469=Filter
746=&Add
747=&File...
748=F&older...
749=&Mask...
750=&Remove
385=To prevent the undesired relocation of some data, you can exclude specific items from defragmentation. The files and folders listed in this window will not be analyzed and/or defragmented.
386=Manage exclusions list
387=List of excluded items:
391=Skip files larger t&han (KB):
743=Skip files having &less than (fragments):
744=Skip files ha&ving fragments larger than:
392=KB
393=MB
394=GB
751=&Add
752=&Remove
459=Mask to add:
460=In order to process specific items, you can setup one or more masks. WinContig will process only the items that match the masks listed in this window. To specify multiple masks, separate each mask by a semicolon (;).
461=Manage inclusions list
462=List of included items:
463=Exclude
464=Include
741=There are no items in the exclusions list.
742=There are no items in the inclusions list.
'-------------------------------------------------------------------------------------
' "Mask file" dialog box ***
'-------------------------------------------------------------------------------------
400=Add mask
401=Specify one or more masks to exclude files and/or folders. To specify multiple masks, separate each mask by a semicolon (;).\n\nExample: *.dll;*.ocx;*.tmp
404=Masks cannot contain any of the following characters:\n \ / : < > | "
405=Exclusion masks:
402=&Add
'-------------------------------------------------------------------------------------
' Warning/Error/Info messages ***
'-------------------------------------------------------------------------------------
174=Unknown error
175=Failed to dump file (infinite main loop).
176=The map of the file is empty.
180=Wrong map file detected.
147=The volume does not have a contiguous run of free clusters that is large enough to contain the entire file.
164=Are you sure you want to remove the selected item?
165=Are you sure you want to remove the selected items?
520=Are you sure you want to remove all items?
166=Confirm
374=The selected item was added to the exclusions list.
375=The selected items were added to the exclusions list.
376=The selected items are already in the exclusions list.
465=Duplicated masks
466=One or more masks are on both the exclusions and inclusions lists. The items matching those masks will not be processed by WinContig.
467=&Close anyway
468=&Edit masks
490=SSD Detected
494=Solid State Device
491=Solid State Devices see no performance benefit from traditional HDD defragmentation. File defragmentation causes lots of write processes and can put undue wear on specific areas of the drives. It is recommended that you do not defragment files on Solid State Devices.
492=&Defragment anyway
493=Do&n't defragment
149=There is not enough physical memory or system resources available to defragment the file.
510=Process is completed
508=Defragmentation process has been completed.
509=Analysis process has been completed.
738=Profile has been modified. Do you wish to save the changes?
320=Computer is running on battery power
315=Operation canceled
316=In order to preserve battery run time, the defragmentation of the files has been canceled.
235=By installing the shell extension of WinContig you can analyze and/or defragment files and folders from the context menu of File Explorer.
304=You can install the shell extension later from the Tools menu.
236=Do you want to install the shell extension of WinContig?
237=&Install
238=Do &not install
301=You can uninstall the shell extension at any time from the Tools menu.
303=Please note that WinContig is a portable program, but some information needs to be written to the system in order to install the shell extension.
302=You are about to install the shell extension of WinContig that will enable you to analyze and/or defragment files and folders from the context menu of File Explorer.
332=You are about to uninstall the shell extension of WinContig. If you continue, you will not be able to analyze and/or defragment files and folders from the context menu of File Explorer.
75=Prior to continuing with uninstallation, please close all instances of File Explorer if any are open.
333=&Uninstall
334=Do &not uninstall
495=The currently installed shell extension of WinContig is not compatible with this version of WinContig. Please, install the new version of the shell extension of WinContig.
497=Prior to continuing with installation, please close all instances of File Explorer if any are open.
458=The shell extension of WinContig has been uninstalled successfully, but it is still in use by Windows. It is recommended to restart your system in order to complete the uninstallation process.
502=After the restart, you can install the new version of the shell extension of WinContig from the Tools menu.
305=Shell extension of WinContig
335=The shell extension of WinContig has been installed successfully.
344=The shell extension of WinContig has been uninstalled successfully.
336=Co&nfigure
337=An error occurred during the installation of the shell extension of WinContig.
348=An error occurred during the uninstallation of the shell extension of WinContig.
342=Return value:
349=Error: the ShellExt subfolder is missing.\n\nInstallation cannot be completed.
350=Error: the shell extension file (%s) is missing.\n\nInstallation cannot be completed.
352=The shell extension of WinContig is still in use by Windows. It is recommended to restart your system in order to complete the uninstallation process.
353=Please note that unless you plan to reinstall or update WinContig, you don't need to restart right away.
354=Do &not restart
368=&Restart
378=You are running the 32-bit version of WinContig on a 64-bit version of Windows.
379=In order to install the shell extension of WinContig on this system, please run the 64-bit version of WinContig.
503=Unable to read information from the Registry.\n\nThe uninstallation of the shell extension of WinContig was canceled.
'-------------------------------------------------------------------------------------
' General Button Captions ***
'-------------------------------------------------------------------------------------
395=&Yes
396=&No
397=OK
398=Cancel
406=&Continue
407=&Quit
142=&Close
689=&Add
'-------------------------------------------------------------------------------------
' General strings ***
'-------------------------------------------------------------------------------------
702=All files (*.*)
703=Profile of WinContig (*.wcp)
384=Text document (*.txt)
'-------------------------------------------------------------------------------------
' File Open Error Messages ***
'-------------------------------------------------------------------------------------
167=Error: out of memory/resources. Couldn't execute!
168=Error: file not found. Couldn't execute!
169=Error: path not found. Couldn't execute!
170=Error: bad file Format. Couldn't execute!
'-------------------------------------------------------------------------------------
' "Fragmentation Details" dialog box ***
'-------------------------------------------------------------------------------------
259=Fragments
260=Name:
261=Path:
262=Type:
263=Size:
264=Size on disk:
265=Fragments:
266=Clusters:
214=Fragmentation:
399=Sort list by:
403=File clusters
408=Disk clusters
409=Fragment size
452=Fragments list:
427=# (file)
410=Start cluster (file)
411=End cluster (file)
417=Start cluster (disk)
418=End cluster (disk)
286=Size (bytes)
233=Clusters
287=% of file
277=This item is not a file.
278=An error was encountered while attempting to analyze the file.
279=This item does not exist.
280=This file does not occupy any clusters.
281=bytes
'-------------------------------------------------------------------------------------
' "Defragmentation Report" dialog box ***
'-------------------------------------------------------------------------------------
184=Defragmentation report
185=Information:
186=Defragmentation process is completed
189=Number of processed files:
190=Number of fragmented files:
191=Number of already contiguous files:
192=Number of defragmented files:
193=Number of files that were not defragmented due to processing errors:
423=This dialog box displays information about the files that were defragmented.
'-------------------------------------------------------------------------------------
' Shutdown dialog box ***
'-------------------------------------------------------------------------------------
194=Shutdown
500=Restart
501=Sign out
757=Sleep
758=Hibernate
196=This system will shut down in 15 seconds.
498=This system will restart in 15 seconds.
499=This system will sign you out in 15 seconds.
759=This system will enter sleep mode in 15 seconds.
760=This system will enter into hibernate state in 15 seconds.
'-------------------------------------------------------------------------------------
' About dialog box ***
'-------------------------------------------------------------------------------------
201=All rights reserved.
202=Freeware for commercial and personal use.
204=About
298=Web site:
299=E-mail:
640=%s Edition
'-------------------------------------------------------------------------------------
' Crash dialog box ***
'-------------------------------------------------------------------------------------
'-------------------------------------------------------------------------------------
' Disclaimer ***
'-------------------------------------------------------------------------------------
206=Disclaimer
221=Copy the text and put it on the Clipboard.
'-------------------------------------------------------------------------------------
' Command-line switches ***
'-------------------------------------------------------------------------------------
208=Command-line switches
389=Command-line switches
390=WinContig accepts a number of optional command-line switches that you can use to control how the program operates.
'-------------------------------------------------------------------------------------
' Search Box Guide ***
'-------------------------------------------------------------------------------------
52=Search Box Guide
55=Search Box Guide
'-------------------------------------------------------------------------------------
' Defragmentation/Analysis process Interrupted ***
'-------------------------------------------------------------------------------------
210=Please wait until the process of the current file is finished...
'-------------------------------------------------------------------------------------
' Disclaimer - RTF Format ***
'-------------------------------------------------------------------------------------
$d$
{\rtf1\ansi\ansicpg1252\deff0\deflang1033\deflangfe1040
\qc {\b\f0\fs24 Disclaimer}
\fs18
\par\par
\pard This software and all the accompanying files are provided by the author "as is" and without any express or implied warranties, including, but not limited to, the implied warranties of merchantability and fitness for a particular purpose. In no event shall the author be liable for any damages whatsoever (including without limitation, damages for loss of business profits, loss of use or data, business interruption, loss of business information, or any other pecuniary loss) arising out of the use or inability to use this product, even if advised of the possibility of such damage. The entire risk arising out of the use or performance of this product and documentation remains with you.
\par}
$d$
'-------------------------------------------------------------------------------------
' Command-line switches - RTF Format *** Please don't translate '%winc%', '%Uwinc%'
'-------------------------------------------------------------------------------------
$c$
{\rtf1\ansi\ansicpg1252\deff0\deflang1033
\viewkind4\uc1\pard\lang1033\f0\fs16
\b SYNTAX\b0\par
\par
%winc% [source] [switches]\par
\par
\par
\b IMPORTANT NOTES\b0\par
\par
\pard{\pntext\tab}{\*\pn\pnlvlblt\pnindent180}\fi-180\li180
Switches are not case sensitive, so, for example, \b /CLOSE\b0  is the same as \b /close\b0 .\par
{\pntext\tab}
When using multiple switches, separate them with a blank space. For example, use the following command line to load a profile and start the file defragmentation:\par
\pard\par\pard\fi180
\b %winc% /defrag /prof:"c:\\data\\profile.wcp"\b0\par
\pard\par
\par
Below is the list of the WinContig switches.\par
\par
\pard\fi-1418\li1418\tx1418
\b source\b0\tab Specifies the files or folders to be loaded in WinContig.\par
\pard\par
\pard\fi-1418\li1418\tx1418\tab
\b IMPORTANT NOTES\b0\par
\par
\pard{\pntext\tab}{\*\pn\pnlvlblt\pnindent180}\li1418
You must specify the full path of \i source\i0\par
{\pntext\tab}
You must enclose the full path of \i source\i0  in quotation marks ("")\par
\pard\li1418\tx1418\par
For example, use the following command line to load the file \i personal.txt\i0  located in \i c:\\documents\i0 :\par
\par
\b %winc% "c:\\documents\\personal.txt"\b0\par
\par\pard\fi-1418\li1418\tx1418
\b /analyze\b0\tab Starts the analysis of the items loaded in WinContig.\par
\par
\b /chkdsk:0\tab\b0 Disables the automatic disk checking. \par
\par
\b /chkdsk:1\b0\tab Starts automatically the disk checking.\par
\par
\b /chkdsk:2\b0\tab Asks the user before starting the disk checking.\par
\par
\b /clean:0\tab\b0 Disables the automatic cleaning up of temporary files.\par
\par
\b /clean:1\tab\b0 Starts automatically the cleaning up of temporary files.\par
\par
\b /clean:2\tab\b0 Asks the user before starting the cleaning up of temporary files.\par
\par
\b /close\b0\tab Used to automatically close WinContig after it has completed the defragmentation process.\par
\par
\b /closeifok\b0\tab Used to automatically close WinContig after it has completed the defragmentation process if all files have been successfully defragmented otherwise it stays open.
 If you use this switch in conjunction with the \b /nogui \b0 switch, WinContig will show the main window after it has completed the defragmentation process if one or more files have not been successfully defragmented.\par
\par
\b /defrag\b0\tab Starts the defragmentation of the items loaded in WinContig.\par
\par
\b /diskzone:auto\tab\b0 Places the file in the first available contiguous run of free clusters that is large enough to contain the entire file. \par
\par
\b /diskzone:fast\tab\b0 Places the file in the fast zone of the disk. If the specified disk zone does not have a contiguous run of free clusters that is large enough to contain the entire file, the file is skipped. In order to instruct WinContig to not skip the file but try to place the file in a different zone of the disk, append an asterisk (*). \par
\pard\li1418\tx1418\par
Examples: \par
\par
\b %winc% "c:\\documents\\personal.txt" /diskzone:fast\b0\par
\b %winc% "c:\\documents\\data.txt" /diskzone:fast*\b0\par
\par\pard\fi-1418\li1418\tx1418
\b /diskzone:slow\tab\b0 Places the file in the slow zone of the disk. If the specified disk zone does not have a contiguous run of free clusters that is large enough to contain the entire file, the file is skipped. In order to instruct WinContig to not skip the file but try to place the file in a different zone of the disk, append an asterisk (*). \par
\pard\li1418\tx1418\par
Examples: \par
\par
\b %winc% "c:\\documents\\personal.txt" /diskzone:slow\b0\par
\b %winc% "c:\\documents\\data.txt" /diskzone:slow*\b0\par
\par\pard\fi-1418\li1418\tx1418
\b /diskzone:\b0\i cluster\i0\tab Places the file in the specified cluster of the disk. If it is not possible to move the file to the specified disk cluster, the file is skipped. In order to instruct WinContig to not skip the file but try to place the file in a different zone of the disk, starting from the specified disk cluster, append an asterisk (*). \par
\pard\li1418\tx1418\par
Examples: \par
\par
\b %winc% "c:\\documents\\personal.txt" /diskzone:5684\b0\par
\b %winc% "c:\\documents\\data.txt" /diskzone:97845*\b0\par
\par\pard\fi-1418\li1418\tx1418
\b /dup\b0\tab Allows duplicate entries in the items list. WinContig does not allow duplicate entries in the items list as default. When using the \b /dup\b0  switch, WinContig adds files to the items list faster. This option is useful if you want to load a very big profile faster and you are confident there are no duplicate entries in the profile.\par
\par
\b /help \b0 or \b/?\b0 \tab Shows this dialog box.\par
\par
\b /lang:\b0\i xx-XX\i0\tab Forces the language used by the user interface. \i xx-XX \i0 specifies a language, for example \i en-US \i0 represents English, while \i fr-FR \i0 represents French.
 If you specify the \b/lang:auto \b0 switch, WinContig will use the system default UI language (if supported).\par
\par
\b /nogui\b0\tab Used to hide the WinContig main window during the analysis process or the defragmentation process. When using the \b /nogui\b0  switch, WinContig provides exit codes that indicate the level of success for a command.\par
\par
\tab\b Exit codes\b0\par
\par
\tab The following command-line exit codes are defined for WinContig.\par
\par
\tab\b 0\b0\tab Success.\par
\tab\b 1\b0\tab Invalid or missing profile.\par
\tab\b 2\b0\tab Errors were found during disk checking.\par
\tab\b 3\b0\tab Not all items were successfully defragmented.\par
\tab\b 4\b0\tab Not all items were successfully analyzed.\par
\tab\b 5\b0\tab Invalid or missing item.\par
\par
\b /noini\b0\tab Used to suppress the writing of the "WinContig.ini" configuration file.\par
\par
\b /nosubdirs\b0\tab Does not include subfolders during the process of folders.\par
\par
\b /ontop\b0\tab Makes the WinContig main window topmost (above all other windows).\par
\par
\b /prof:\b0\i "profile"\i0\tab Used to load the profile \i profile\i0 .\par
\par\tab
\b IMPORTANT NOTES\b0\par
\par
\pard{\pntext\tab}{\*\pn\pnlvlblt\pnindent180}\li1418
You must specify the full path of the profile\par
{\pntext\tab}
You must enclose the full path of the profile in quotation marks ("")\par
\pard\li1418\tx1418\par
For example, use the following command line to load the profile \i data.wcp\i0  located in \i c:\\profiles\i0 :\par
\par
\b %winc% /prof:"c:\\profiles\\data.wcp"\b0\par
\pard\fi-1418\li1418\tx1418\par
\b /quick\b0\tab Used to turn off optimizations during the defragmentation process (i.e., WinContig will not try to fill the gaps and will not try to partially defragment the files that it is not possible to totally defrag). Using this switch decreases the time required to complete the defragmentation process.\par
\par
\b /recurse\b0\tab Searches for every occurrence of the specified file name within the specified folder and all subfolders.\par
\par
\b /shutdown\b0\tab Used to shut down the computer after WinContig has completed the defragmentation process.\par
\par
}
$c$
'-------------------------------------------------------------------------------------
' Search for fragmented files (Guide) - RTF Format ***
'-------------------------------------------------------------------------------------
$s$
{\rtf1\ansi\ansicpg1252\deff0\deflang1040
\fs18
The Search box allows you to find a specific fragmented file or set of fragmented files. The most basic way to search is to type in a word.
\b  \b0
So, for example, if you type \i install\i0  into the Search box, WinContig will only list fragmented files that contain \i install, Install, Installation,\i0  and \i uninstall\i0  in their names or in their paths.
\par\par\par
\b\fs24 Wildcard characters\b0
\fs18
\par\par
In addition to searching for different words, you can use wildcards to get more control over your search results. Wildcard characters are special characters that are used to represent one or more other characters.
\par\par
Below is the list of the supported wildcards.
\par\par
\pard\sl320\slmult1
\tx1418\tx4260
\b Syntax\b0\tab\b Expression\b0\tab\b Description\b0\par
\pard
\fi-1418\li1418\tx1418
\fi-4260\li4260\tx4260
? \tab Any single character\tab Matches any single character.\par
* \tab One or more characters\tab Matches any one or more characters.\par
\par
For example:
\par
\pard\par
\pard
{\pntext\f3\'B7\tab}{\*\pn\pnlvlblt\pnf3\pnindent140{\pntxtb\'B7}}\fi-140\li140\tx140
\i data*\i0  will match any word starting with \i data\i0 , as \i data, database, datable\i0 , and so on, but not \i metadata\i0 .
\par
{\pntext\f3\'B7\tab}
\i win?\i0  will only match four-letter words starting with \i win\i0 , as \i wine, wind, wing\i0 , and so on.
\par
\pard\par
You can use more than one wildcard in a search word, and both wildcard characters can be used in combination. For example, \i prog?*\i0  will match any word starting with \i prog\i0  with one or more characters.
\par\par
Spaces are used to break up the search string into words and keywords. Search terms that contain a space character must be enclosed in double quotes (" "). For example, if you type \i program data\i0  into the Search box, WinContig will list all fragmented files that contain \i program\i0  anywhere in their names or paths and that contain \i data\i0  anywhere in their names or paths. If you type \i "program data"\i0 , WinContig will list all fragmented files that contain \i program data\i0  anywhere in their names or paths.
\par\par\par
\b\fs24 Keywords and search conditions\b0
\fs18
\par\par
You can use various keywords to narrow your search results. Keyword searches are not case sensitive and use the following syntax:
\par\par
\i <keyword>:<value>\i0
\par\par
Values are not case sensitive, and they can't have a space after the operator. For example, \i size:> 100\i0  searches for "100" as a word, rather than fragmented files whose size is larger than 100 KB.
\par\par
The following table lists the available keywords.
\par\par
\pard\sl320\slmult1
\tx1098\tx3260
\b Keyword\b0\tab\b Example\b0\tab\b Function\b0\par
\pard\fi-1098\li1098\tx1098\fi-3260\li3260\tx3260
name \tab name:text\tab Search for fragmented files containing \i text\i0  in their names.\par
\par
path \tab path:"program files"\tab Search for fragmented files containing \i program files\i0  in their paths. Note the use of double quotes so that the search results match the phrase within the quotes.\par
\par
frag \tab frag:>10\tab Search for fragmented files having more than 10 fragments.\par
\tab frag:<10\tab Search for fragmented files having less than 10 fragments.\par
\tab frag:=10\tab Search for fragmented files having exactly 10 fragments.\par
\tab frag:10..30\tab Search for fragmented files whose number of fragments is greater than or equal to 10 and less than or equal to 30.\par
\par
size \tab size:>100\tab Search for fragmented files whose size is larger than 100 KB. Note that the value must be in KB.\par
\tab size:<100\tab Search for fragmented files whose size is less than 100 KB. Note that the value must be in KB.\par
\tab size:=100\tab Search for fragmented files having size 100 KB. Note that the value must be in KB.\par
\tab size:100..200\tab Search for fragmented files whose size is greater than or equal to 100 and less than or equal to 200. Note that the values must be in KB.\par
\par\par
\b\fs24 Keyboard shortcuts\b0
\fs18
\par\par
The following table contains keyboard shortcuts for working with the Search box.
\par\par
\pard\sl320\slmult1
\tx1418
\b Key\b0\tab\b Action\b0\par
\pard
\fi-1418\li1418\tx1418
Esc or Tab \tab Clear a search and exit from the Search box.\par
CTRL+N \tab Clear a search and start a new search.\par
CTRL+K \tab Show a popup menu from which you can insert a keyword into the Search box.\par
\par
}
$s$
